RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/include/ip/cyip_eth.h
   __IM uint32_t FRAMES_TXED_65;                /*!< 0x0000111C 65 to 127 Byte Frames Transmitted */
   __IM uint32_t FRAMES_TXED_128;               /*!< 0x00001120 128 to 255 Byte Frames Transmitted */
   __IM uint32_t FRAMES_TXED_256;               /*!< 0x00001124 256 to 511 Byte Frames Transmitted */
   __IM uint32_t FRAMES_TXED_512;               /*!< 0x00001128 512 to 1023 Byte Frames Transmitted */
   __IM uint32_t FRAMES_TXED_1024;              /*!< 0x0000112C 1024 to 1518 Byte Frames Transmitted */
   __IM uint32_t FRAMES_TXED_1519;              /*!< 0x00001130 Greater Than 1518 Byte Frames Transmitted */
   __IM uint32_t TX_UNDERRUNS;                  /*!< 0x00001134 Transmit Under Runs */
   __IM uint32_t SINGLE_COLLISIONS;             /*!< 0x00001138 Single Collision Frames. Presents in design but not support. */
   __IM uint32_t MULTIPLE_COLLISIONS;           /*!< 0x0000113C Multiple Collision Frames. Presents in design but not support. */
   __IM uint32_t EXCESSIVE_COLLISIONS;          /*!< 0x00001140 Excessive Collisions.  Presents in design but not support. */
   __IM uint32_t LATE_COLLISIONS;               /*!< 0x00001144 Late Collisions.  Presents in design but not support. */
   __IM uint32_t DEFERRED_FRAMES;               /*!< 0x00001148 Deferred Transmission Frames. Presents in design but not
                                                                support. */
   __IM uint32_t CRS_ERRORS;                    /*!< 0x0000114C Carrier Sense Errors.  Presents in design but not support. */
   __IM uint32_t OCTETS_RXED_BOTTOM;            /*!< 0x00001150 Octets Received (31 to 0 bits) */
   __IM uint32_t OCTETS_RXED_TOP;               /*!< 0x00001154 Octets Received (47 to 32 bits) */
   __IM uint32_t FRAMES_RXED_OK;                /*!< 0x00001158 Frames Received */
   __IM uint32_t BROADCAST_RXED;                /*!< 0x0000115C Broadcast Frames Received */
   __IM uint32_t MULTICAST_RXED;                /*!< 0x00001160 Multicast Frames Received */
   __IM uint32_t PAUSE_FRAMES_RXED;             /*!< 0x00001164 Pause Frames Received */
   __IM uint32_t FRAMES_RXED_64;                /*!< 0x00001168 64 Byte Frames Received */
   __IM uint32_t FRAMES_RXED_65;                /*!< 0x0000116C 65 to 127 Byte Frames Received */
   __IM uint32_t FRAMES_RXED_128;               /*!< 0x00001170 128 to 255 Byte Frames Received */
   __IM uint32_t FRAMES_RXED_256;               /*!< 0x00001174 256 to 511 Byte Frames Received */
   __IM uint32_t FRAMES_RXED_512;               /*!< 0x00001178 512 to 1023 Byte Frames Received */
   __IM uint32_t FRAMES_RXED_1024;              /*!< 0x0000117C 1024 to 1518 Byte Frames Received */
   __IM uint32_t FRAMES_RXED_1519;              /*!< 0x00001180 1519 to maximum Byte Frames Received */
   __IM uint32_t UNDERSIZE_FRAMES;              /*!< 0x00001184 Undersized Frames Received */
   __IM uint32_t EXCESSIVE_RX_LENGTH;           /*!< 0x00001188 Oversize Frames Received */
   __IM uint32_t RX_JABBERS;                    /*!< 0x0000118C Jabbers Received */
   __IM uint32_t FCS_ERRORS;                    /*!< 0x00001190 Frame Check Sequence Errors */
   __IM uint32_t RX_LENGTH_ERRORS;              /*!< 0x00001194 Length Field Frame Errors */
   __IM uint32_t RX_SYMBOL_ERRORS;              /*!< 0x00001198 Receive Symbol Errors */
   __IM uint32_t ALIGNMENT_ERRORS;              /*!< 0x0000119C Alignment Errors */
   __IM uint32_t RX_RESOURCE_ERRORS;            /*!< 0x000011A0 Receive Resource Errors */
   __IM uint32_t RX_OVERRUNS;                   /*!< 0x000011A4 Receive Overruns */
   __IM uint32_t RX_IP_CK_ERRORS;               /*!< 0x000011A8 IP Header Checksum Errors */
   __IM uint32_t RX_TCP_CK_ERRORS;              /*!< 0x000011AC TCP Checksum Errors */
   __IM uint32_t RX_UDP_CK_ERRORS;              /*!< 0x000011B0 UDP Checksum Errors */
   __IM uint32_t AUTO_FLUSHED_PKTS;             /*!< 0x000011B4 Receive DMA Flushed Packets */
   __IM uint32_t RESERVED3;
  __IOM uint32_t TSU_TIMER_INCR_SUB_NSEC;       /*!< 0x000011BC 1588 Timer Increment Register sub nsec */
  __IOM uint32_t TSU_TIMER_MSB_SEC;             /*!< 0x000011C0 1588 Timer Seconds Register (47 to 32 bits) */
   __IM uint32_t TSU_STROBE_MSB_SEC;            /*!< 0x000011C4 1588 Timer Sync Strobe Seconds Register (47 to 32 bits) */
   __IM uint32_t TSU_STROBE_SEC;                /*!< 0x000011C8 1588 Timer Sync Strobe Seconds Register (31 to 0 bits) */
   __IM uint32_t TSU_STROBE_NSEC;               /*!< 0x000011CC 1588 Timer Sync Strobe Nanoseconds Register */
  __IOM uint32_t TSU_TIMER_SEC;                 /*!< 0x000011D0 1588 Timer Seconds Register (31 to 0 bits) */
  __IOM uint32_t TSU_TIMER_NSEC;                /*!< 0x000011D4 1588 Timer Nanoseconds Register */
   __OM uint32_t TSU_TIMER_ADJUST;              /*!< 0x000011D8 This register is used to adjust the value of the timer in the
                                                                TSU. It allows an integral number of nanoseconds to be added or
                                                                subtracted from the timer in a one-off operation. This register
                                                                returns all zeroes when read. */
  __IOM uint32_t TSU_TIMER_INCR;                /*!< 0x000011DC 1588 Timer Increment Register */
   __IM uint32_t TSU_PTP_TX_SEC;                /*!< 0x000011E0 PTP Event Frame Transmitted Seconds Register (31 to 0 bits) */
   __IM uint32_t TSU_PTP_TX_NSEC;               /*!< 0x000011E4 PTP Event Frame Transmitted Nanoseconds Register */
   __IM uint32_t TSU_PTP_RX_SEC;                /*!< 0x000011E8 PTP Event Frame Received Seconds Register (31 to 0 bits) */
   __IM uint32_t TSU_PTP_RX_NSEC;               /*!< 0x000011EC PTP Event Frame Received Nanoseconds Register */
   __IM uint32_t TSU_PEER_TX_SEC;               /*!< 0x000011F0 PTP Peer Event Frame Transmitted Seconds Register (31 to 0
                                                                bits) */
   __IM uint32_t TSU_PEER_TX_NSEC;              /*!< 0x000011F4 PTP Peer Event Frame Transmitted Nanoseconds Register */
   __IM uint32_t TSU_PEER_RX_SEC;               /*!< 0x000011F8 PTP Peer Event Frame Received Seconds Register (31 to 0 bits) */
   __IM uint32_t TSU_PEER_RX_NSEC;              /*!< 0x000011FC PTP Peer Event Frame Received Nanoseconds Register */
   __IM uint32_t PCS_CONTROL;                   /*!< 0x00001200 Not presents. Access to the register returns AHB error. */
   __IM uint32_t PCS_STATUS;                    /*!< 0x00001204 Not presents. Access to the register returns AHB error. */
   __IM uint32_t RESERVED4[2];
   __IM uint32_t PCS_AN_ADV;                    /*!< 0x00001210 Not presents. Access to the register returns AHB error. */
   __IM uint32_t PCS_AN_LP_BASE;                /*!< 0x00001214 Not presents. Access to the register returns AHB error. */
   __IM uint32_t PCS_AN_EXP;                    /*!< 0x00001218 Not presents. Access to the register returns AHB error. */
   __IM uint32_t PCS_AN_NP_TX;                  /*!< 0x0000121C Not presents. Access to the register returns AHB error. */
   __IM uint32_t PCS_AN_LP_NP;                  /*!< 0x00001220 Not presents. Access to the register returns AHB error. */
   __IM uint32_t RESERVED5[6];
   __IM uint32_t PCS_AN_EXT_STATUS;             /*!< 0x0000123C Not presents. Access to the register returns AHB error. */
   __IM uint32_t RESERVED6[8];
  __IOM uint32_t TX_PAUSE_QUANTUM1;             /*!< 0x00001260 Transmit Pause Quantum Register 1 */
  __IOM uint32_t TX_PAUSE_QUANTUM2;             /*!< 0x00001264 Transmit Pause Quantum Register 2 */
  __IOM uint32_t TX_PAUSE_QUANTUM3;             /*!< 0x00001268 Transmit Pause Quantum Register 3 */
   __IM uint32_t RESERVED7;
   __IM uint32_t RX_LPI;                        /*!< 0x00001270 Received LPI transitions */
   __IM uint32_t RX_LPI_TIME;                   /*!< 0x00001274 Received LPI time */
   __IM uint32_t TX_LPI;                        /*!< 0x00001278 Transmit LPI transitions */
   __IM uint32_t TX_LPI_TIME;                   /*!< 0x0000127C Transmit LPI time */
   __IM uint32_t DESIGNCFG_DEBUG1;              /*!< 0x00001280 The GEM_GXL(3PIP) has many parameterisation options to
                                                                configure the IP during compilation stage. This is achieved
                                                                using Verilog define compiler directives in an include file
                                                                called mxeth_defs.v. */
   __IM uint32_t DESIGNCFG_DEBUG2;              /*!< 0x00001284 Design Configuration Register 2 */
   __IM uint32_t DESIGNCFG_DEBUG3;              /*!< 0x00001288 Design Configuration Register 3 */
   __IM uint32_t DESIGNCFG_DEBUG4;              /*!< 0x0000128C Design Configuration Register 4 */
   __IM uint32_t DESIGNCFG_DEBUG5;              /*!< 0x00001290 Design Configuration Register 5 */
   __IM uint32_t DESIGNCFG_DEBUG6;              /*!< 0x00001294 Design Configuration Register 6 */
   __IM uint32_t DESIGNCFG_DEBUG7;              /*!< 0x00001298 Design Configuration Register 7 */
   __IM uint32_t DESIGNCFG_DEBUG8;              /*!< 0x0000129C Design Configuration Register 8 */
   __IM uint32_t DESIGNCFG_DEBUG9;              /*!< 0x000012A0 Design Configuration Register 9 */
   __IM uint32_t DESIGNCFG_DEBUG10;             /*!< 0x000012A4 Design Configuration Register 10 */
   __IM uint32_t RESERVED8[22];
   __IM uint32_t SPEC_ADD5_BOTTOM;              /*!< 0x00001300 Specific address registers 5 ~ 36 doesn't present. Access to
                                                                the register returns AHB error. */
   __IM uint32_t SPEC_ADD5_TOP;                 /*!< 0x00001304 Specific address registers 5 ~ 36 doesn't present. Access to
                                                                the register returns AHB error. */
   __IM uint32_t RESERVED9[60];
   __IM uint32_t SPEC_ADD36_BOTTOM;             /*!< 0x000013F8 Not presents. */
   __IM uint32_t SPEC_ADD36_TOP;                /*!< 0x000013FC Not presents. */
   __IM uint32_t INT_Q1_STATUS;                 /*!< 0x00001400 Priority queue Interrupt Status Register */
   __IM uint32_t INT_Q2_STATUS;                 /*!< 0x00001404 Priority queue Interrupt Status Register */
   __IM uint32_t INT_Q3_STATUS;                 /*!< 0x00001408 int_q3_status to int_q15_status doesn't present. Access to the
                                                                register returns AHB error. */
   __IM uint32_t RESERVED10[11];
   __IM uint32_t INT_Q15_STATUS;                /*!< 0x00001438 Not presents. */
   __IM uint32_t RESERVED11;
  __IOM uint32_t TRANSMIT_Q1_PTR;               /*!< 0x00001440 This register holds the start address of the transmit buffer
                                                                queue (transmit buffers descriptor list). The transmit buffer
                                                                queue base address register must be initialized before transmit
                                                                is started through bit 9 of the network control register. Once
                                                                transmission has started, any write to the transmit buffer queue
                                                                base address register is illegal and therefore ignored. Note
                                                                that due to clock boundary synchronization, it takes a maximum
                                                                of four pclk cycles from the writing of the transmit start bit
                                                                before the transmitter is active. Writing to the transmit buffer
                                                                queue base address register during this time may produce
                                                                unpredictable results. Reading this register returns the
                                                                location of the descriptor currently being accessed. Because the
                                                                DMA can store data for multiple frames at once, this may not
                                                                necessarily be pointing to the current frame being transmitted.
                                                                In terms of AMBA AXI operation, the transmit descriptors are
                                                                written to memory using a single 32bit AHB access. When the
                                                                datapath is configured as 64bit , the transmit descriptors
                                                                should be aligned at 64-bit boundaries and each pair of 32-bit
                                                                descriptors is read from memory using a single AXI access. */
  __IOM uint32_t TRANSMIT_Q2_PTR;               /*!< 0x00001444 This register holds the start address of the transmit buffer
                                                                queue (transmit buffers descriptor list). The transmit buffer
                                                                queue base address register must be initialized before transmit
                                                                is started through bit 9 of the network control register. Once
                                                                transmission has started, any write to the transmit buffer queue
                                                                base address register is illegal and therefore ignored. Note
                                                                that due to clock boundary synchronization, it takes a maximum
                                                                of four pclk cycles from the writing of the transmit start bit
                                                                before the transmitter is active. Writing to the transmit buffer
                                                                queue base address register during this time may produce
                                                                unpredictable results. Reading this register returns the
                                                                location of the descriptor currently being accessed. Because the
                                                                DMA can store data for multiple frames at once, this may not
                                                                necessarily be pointing to the current frame being transmitted.
                                                                In terms of AMBA AXI operation, the transmit descriptors are
                                                                written to memory using a single 32bit AHB access. When the
                                                                datapath is configured as 64bit , the transmit descriptors
                                                                should be aligned at 64-bit boundaries and each pair of 32-bit
                                                                descriptors is read from memory using a single AXI access. */
   __IM uint32_t TRANSMIT_Q3_PTR;               /*!< 0x00001448 transmit_q3_ptr to transmit_q15_ptr doesn't present. Access to
                                                                the register returns AHB error. */
   __IM uint32_t RESERVED12[11];
   __IM uint32_t TRANSMIT_Q15_PTR;              /*!< 0x00001478 Not presents. */
   __IM uint32_t RESERVED13;
  __IOM uint32_t RECEIVE_Q1_PTR;                /*!< 0x00001480 This register holds the start address of the transmit buffer
                                                                queue (transmit buffers descriptor list). The transmit buffer
                                                                queue base address register must be initialized before transmit
                                                                is started through bit 9 of the network control register. Once
                                                                transmission has started, any write to the transmit buffer queue
                                                                base address register is illegal and therefore ignored. Note
                                                                that due to clock boundary synchronization, it takes a maximum
                                                                of four pclk cycles from the writing of the transmit start bit
                                                                before the transmitter is active. Writing to the transmit buffer
                                                                queue base address register during this time may produce
                                                                unpredictable results. Reading this register returns the
                                                                location of the descriptor currently being accessed. Because the
                                                                DMA can store data for multiple frames at once, this may not
                                                                necessarily be pointing to the current frame being transmitted.
                                                                In terms of AMBA AXI operation, the transmit descriptors are
                                                                written to memory using a single 32bit AHB access. When the
                                                                datapath is configured as 64bit , the transmit descriptors
                                                                should be aligned at 64-bit boundaries and each pair of 32-bit
                                                                descriptors is read from memory using a single AXI access. */
  __IOM uint32_t RECEIVE_Q2_PTR;                /*!< 0x00001484 This register holds the start address of the transmit buffer
                                                                queue (transmit buffers descriptor list). The transmit buffer
                                                                queue base address register must be initialized before transmit
                                                                is started through bit 9 of the network control register. Once
                                                                transmission has started, any write to the transmit buffer queue
                                                                base address register is illegal and therefore ignored. Note
                                                                that due to clock boundary synchronization, it takes a maximum
                                                                of four pclk cycles from the writing of the transmit start bit
                                                                before the transmitter is active. Writing to the transmit buffer
                                                                queue base address register during this time may produce
                                                                unpredictable results. Reading this register returns the
                                                                location of the descriptor currently being accessed. Because the
                                                                DMA can store data for multiple frames at once, this may not
                                                                necessarily be pointing to the current frame being transmitted.
                                                                In terms of AMBA AXI operation, the transmit descriptors are
                                                                written to memory using a single 32bit AHB access. When the
                                                                datapath is configured as 64bit , the transmit descriptors
                                                                should be aligned at 64-bit boundaries and each pair of 32-bit
                                                                descriptors is read from memory using a single AXI access. */
   __IM uint32_t RECEIVE_Q3_PTR;                /*!< 0x00001488 Not presents. Start address register doesn't present for queue3
                                                                ~ queue7. */
   __IM uint32_t RESERVED14[3];
   __IM uint32_t RECEIVE_Q7_PTR;                /*!< 0x00001498 Not presents. */
   __IM uint32_t RESERVED15;
  __IOM uint32_t DMA_RXBUF_SIZE_Q1;             /*!< 0x000014A0 Receive Buffer queue 1 Size */
  __IOM uint32_t DMA_RXBUF_SIZE_Q2;             /*!< 0x000014A4 Receive Buffer queue 2 Size */
   __IM uint32_t DMA_RXBUF_SIZE_Q3;             /*!< 0x000014A8 dma_rxbuf_size_q3 to dma_rxbuf_size_q7 doesn't present. */
   __IM uint32_t RESERVED16[3];
   __IM uint32_t DMA_RXBUF_SIZE_Q7;             /*!< 0x000014B8 Not presents. */
  __IOM uint32_t CBS_CONTROL;                   /*!< 0x000014BC The IdleSlope value is defined as the rate of change of credit
                                                                when a packet is waiting to be sent. This must not exceed the
                                                                portTransmitRate which is dependent on the speed of operation,
                                                                eg, portTranmsitRate. 1Gb/s = 32'h07735940 (125 Mbytes/s),
                                                                100Mb/sec = 32'h017D7840 (25 Mnibbles/s), 10Mb/sec =
                                                                32'h002625A0 (2.5 Mnibbles/s). If 50 percent of bandwidth was to
                                                                be allocated to a particular queue in 1Gb/sec mode then the
                                                                IdleSlope value for that queue would be calculated as
                                                                32'h07735940/2. Note that Credit-Based Shaping should be
                                                                disabled prior to updating the IdleSlope values. As another
                                                                example, for a 1722 audio packet with a payload of 6 samples per
                                                                channel, the packet size would be 7 (preamble) + 1 (SFD) + 50
                                                                (packet header) + 6x4x2(payload) + 4 (CRC) = 110 bytes. For a
                                                                rate of 8000 packets per second, the desired rate would 110 x
                                                                8000 bytes per second, so the programmed idleSlope value would
                                                                be 880000 for a 1Gb/s connection, or 1760000 for a 100Mb/s or
                                                                10Mbs connection. See Figure 6.3 in the IEEE 1722 standard. In
                                                                practice, the actual transmission rate will be vary slightly
                                                                from that calculated. In this case, the idleSlope value should
                                                                be recalibrated based on the variance between the measured and
