RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/include/ip/cyip_eth.h
                                                                15 to 8 of the configured VALUE and so on. The OFFSET can be
                                                                configured to be from 0 to 127 bytes from either the start of
                                                                the frame, the byte following the therType field (last EtherType
                                                                in the header if the frame is VLAN tagged), the byte following
                                                                the IP header (IPv4 or IPv6) or from the byte following the
                                                                start of the TCP/UDP header. The required number of Type 2
                                                                screening registers up to a maximum of 32 is configurable in the
                                                                gem defines file and have been allocated APB address space
                                                                between 0x700 and 0x7fc. Note. when using RX Partial Store and
                                                                Forward mode and priority queues, the frame offset must be less
                                                                than the Partial Store and Forward watermark. If the offset is
                                                                higher than the watermark value it's not possible to identify
                                                                the priority queue before the frame is sent to the AMBA
                                                                interface, and an incorrect priority queue may be used. ' */
  __IOM uint32_t TYPE2_COMPARE_0_WORD_1;        /*!< 0x00001704 'Type2 Compare Word 1' */
  __IOM uint32_t TYPE2_COMPARE_1_WORD_0;        /*!< 0x00001708 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_1_WORD_1;        /*!< 0x0000170C same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_2_WORD_0;        /*!< 0x00001710 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_2_WORD_1;        /*!< 0x00001714 same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_3_WORD_0;        /*!< 0x00001718 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_3_WORD_1;        /*!< 0x0000171C same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_4_WORD_0;        /*!< 0x00001720 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_4_WORD_1;        /*!< 0x00001724 same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_5_WORD_0;        /*!< 0x00001728 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_5_WORD_1;        /*!< 0x0000172C same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_6_WORD_0;        /*!< 0x00001730 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_6_WORD_1;        /*!< 0x00001734 same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_7_WORD_0;        /*!< 0x00001738 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_7_WORD_1;        /*!< 0x0000173C same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_8_WORD_0;        /*!< 0x00001740 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_8_WORD_1;        /*!< 0x00001744 same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_9_WORD_0;        /*!< 0x00001748 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_9_WORD_1;        /*!< 0x0000174C same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_10_WORD_0;       /*!< 0x00001750 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_10_WORD_1;       /*!< 0x00001754 same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_11_WORD_0;       /*!< 0x00001758 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_11_WORD_1;       /*!< 0x0000175C same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_12_WORD_0;       /*!< 0x00001760 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_12_WORD_1;       /*!< 0x00001764 same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_13_WORD_0;       /*!< 0x00001768 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_13_WORD_1;       /*!< 0x0000176C same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_14_WORD_0;       /*!< 0x00001770 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_14_WORD_1;       /*!< 0x00001774 same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_15_WORD_0;       /*!< 0x00001778 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_15_WORD_1;       /*!< 0x0000177C same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_16_WORD_0;       /*!< 0x00001780 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_16_WORD_1;       /*!< 0x00001784 same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_17_WORD_0;       /*!< 0x00001788 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_17_WORD_1;       /*!< 0x0000178C same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_18_WORD_0;       /*!< 0x00001790 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_18_WORD_1;       /*!< 0x00001794 same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_19_WORD_0;       /*!< 0x00001798 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_19_WORD_1;       /*!< 0x0000179C same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_20_WORD_0;       /*!< 0x000017A0 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_20_WORD_1;       /*!< 0x000017A4 same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_21_WORD_0;       /*!< 0x000017A8 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_21_WORD_1;       /*!< 0x000017AC same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_22_WORD_0;       /*!< 0x000017B0 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_22_WORD_1;       /*!< 0x000017B4 same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_23_WORD_0;       /*!< 0x000017B8 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_23_WORD_1;       /*!< 0x000017BC same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_24_WORD_0;       /*!< 0x000017C0 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_24_WORD_1;       /*!< 0x000017C4 same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_25_WORD_0;       /*!< 0x000017C8 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_25_WORD_1;       /*!< 0x000017CC same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_26_WORD_0;       /*!< 0x000017D0 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_26_WORD_1;       /*!< 0x000017D4 same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_27_WORD_0;       /*!< 0x000017D8 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_27_WORD_1;       /*!< 0x000017DC same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_28_WORD_0;       /*!< 0x000017E0 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_28_WORD_1;       /*!< 0x000017E4 same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_29_WORD_0;       /*!< 0x000017E8 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_29_WORD_1;       /*!< 0x000017EC same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_30_WORD_0;       /*!< 0x000017F0 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_30_WORD_1;       /*!< 0x000017F4 same as type2_compare_0_word_1 */
  __IOM uint32_t TYPE2_COMPARE_31_WORD_0;       /*!< 0x000017F8 same as type2_compare_0_word_0 */
  __IOM uint32_t TYPE2_COMPARE_31_WORD_1;       /*!< 0x000017FC same as type2_compare_0_word_1 */
} ETH_Type;                                     /*!< Size = 6144 (0x1800) */


