RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/include/ip/cyip_eth.h
#define ETH_SCREENING_TYPE_2_REGISTER_10_VLAN_PRIORITY_Pos 4UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_VLAN_PRIORITY_Msk 0x70UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_RESERVED_7_Pos 7UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_RESERVED_7_Msk 0x80UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_VLAN_ENABLE_Pos 8UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_VLAN_ENABLE_Msk 0x100UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_INDEX_Pos 9UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_INDEX_Msk 0xE00UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_ETHERTYPE_ENABLE_Pos 12UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_ETHERTYPE_ENABLE_Msk 0x1000UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_COMPARE_A_Pos 13UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_COMPARE_A_Msk 0x3E000UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_COMPARE_A_ENABLE_Pos 18UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_COMPARE_A_ENABLE_Msk 0x40000UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_COMPARE_B_Pos 19UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_COMPARE_B_Msk 0xF80000UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_COMPARE_B_ENABLE_Pos 24UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_COMPARE_B_ENABLE_Msk 0x1000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_COMPARE_C_Pos 25UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_COMPARE_C_Msk 0x3E000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_COMPARE_C_ENABLE_Pos 30UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_COMPARE_C_ENABLE_Msk 0x40000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_RESERVED_31_Pos 31UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_RESERVED_31_Msk 0x80000000UL
/* ETH.SCREENING_TYPE_2_REGISTER_11 */
#define ETH_SCREENING_TYPE_2_REGISTER_11_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_2_REGISTER_11_VLAN_PRIORITY_Pos 4UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_VLAN_PRIORITY_Msk 0x70UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_RESERVED_7_Pos 7UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_RESERVED_7_Msk 0x80UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_VLAN_ENABLE_Pos 8UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_VLAN_ENABLE_Msk 0x100UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_INDEX_Pos 9UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_INDEX_Msk 0xE00UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_ETHERTYPE_ENABLE_Pos 12UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_ETHERTYPE_ENABLE_Msk 0x1000UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_COMPARE_A_Pos 13UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_COMPARE_A_Msk 0x3E000UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_COMPARE_A_ENABLE_Pos 18UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_COMPARE_A_ENABLE_Msk 0x40000UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_COMPARE_B_Pos 19UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_COMPARE_B_Msk 0xF80000UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_COMPARE_B_ENABLE_Pos 24UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_COMPARE_B_ENABLE_Msk 0x1000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_COMPARE_C_Pos 25UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_COMPARE_C_Msk 0x3E000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_COMPARE_C_ENABLE_Pos 30UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_COMPARE_C_ENABLE_Msk 0x40000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_RESERVED_31_Pos 31UL
#define ETH_SCREENING_TYPE_2_REGISTER_11_RESERVED_31_Msk 0x80000000UL
/* ETH.SCREENING_TYPE_2_REGISTER_12 */
#define ETH_SCREENING_TYPE_2_REGISTER_12_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_2_REGISTER_12_VLAN_PRIORITY_Pos 4UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_VLAN_PRIORITY_Msk 0x70UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_RESERVED_7_Pos 7UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_RESERVED_7_Msk 0x80UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_VLAN_ENABLE_Pos 8UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_VLAN_ENABLE_Msk 0x100UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_INDEX_Pos 9UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_INDEX_Msk 0xE00UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_ETHERTYPE_ENABLE_Pos 12UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_ETHERTYPE_ENABLE_Msk 0x1000UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_COMPARE_A_Pos 13UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_COMPARE_A_Msk 0x3E000UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_COMPARE_A_ENABLE_Pos 18UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_COMPARE_A_ENABLE_Msk 0x40000UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_COMPARE_B_Pos 19UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_COMPARE_B_Msk 0xF80000UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_COMPARE_B_ENABLE_Pos 24UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_COMPARE_B_ENABLE_Msk 0x1000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_COMPARE_C_Pos 25UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_COMPARE_C_Msk 0x3E000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_COMPARE_C_ENABLE_Pos 30UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_COMPARE_C_ENABLE_Msk 0x40000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_RESERVED_31_Pos 31UL
#define ETH_SCREENING_TYPE_2_REGISTER_12_RESERVED_31_Msk 0x80000000UL
/* ETH.SCREENING_TYPE_2_REGISTER_13 */
#define ETH_SCREENING_TYPE_2_REGISTER_13_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_2_REGISTER_13_VLAN_PRIORITY_Pos 4UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_VLAN_PRIORITY_Msk 0x70UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_RESERVED_7_Pos 7UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_RESERVED_7_Msk 0x80UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_VLAN_ENABLE_Pos 8UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_VLAN_ENABLE_Msk 0x100UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_INDEX_Pos 9UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_INDEX_Msk 0xE00UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_ETHERTYPE_ENABLE_Pos 12UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_ETHERTYPE_ENABLE_Msk 0x1000UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_COMPARE_A_Pos 13UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_COMPARE_A_Msk 0x3E000UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_COMPARE_A_ENABLE_Pos 18UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_COMPARE_A_ENABLE_Msk 0x40000UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_COMPARE_B_Pos 19UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_COMPARE_B_Msk 0xF80000UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_COMPARE_B_ENABLE_Pos 24UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_COMPARE_B_ENABLE_Msk 0x1000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_COMPARE_C_Pos 25UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_COMPARE_C_Msk 0x3E000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_COMPARE_C_ENABLE_Pos 30UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_COMPARE_C_ENABLE_Msk 0x40000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_RESERVED_31_Pos 31UL
#define ETH_SCREENING_TYPE_2_REGISTER_13_RESERVED_31_Msk 0x80000000UL
/* ETH.SCREENING_TYPE_2_REGISTER_14 */
#define ETH_SCREENING_TYPE_2_REGISTER_14_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_2_REGISTER_14_VLAN_PRIORITY_Pos 4UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_VLAN_PRIORITY_Msk 0x70UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_RESERVED_7_Pos 7UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_RESERVED_7_Msk 0x80UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_VLAN_ENABLE_Pos 8UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_VLAN_ENABLE_Msk 0x100UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_INDEX_Pos 9UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_INDEX_Msk 0xE00UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_ETHERTYPE_ENABLE_Pos 12UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_ETHERTYPE_ENABLE_Msk 0x1000UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_COMPARE_A_Pos 13UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_COMPARE_A_Msk 0x3E000UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_COMPARE_A_ENABLE_Pos 18UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_COMPARE_A_ENABLE_Msk 0x40000UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_COMPARE_B_Pos 19UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_COMPARE_B_Msk 0xF80000UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_COMPARE_B_ENABLE_Pos 24UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_COMPARE_B_ENABLE_Msk 0x1000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_COMPARE_C_Pos 25UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_COMPARE_C_Msk 0x3E000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_COMPARE_C_ENABLE_Pos 30UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_COMPARE_C_ENABLE_Msk 0x40000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_RESERVED_31_Pos 31UL
#define ETH_SCREENING_TYPE_2_REGISTER_14_RESERVED_31_Msk 0x80000000UL
/* ETH.SCREENING_TYPE_2_REGISTER_15 */
#define ETH_SCREENING_TYPE_2_REGISTER_15_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_2_REGISTER_15_VLAN_PRIORITY_Pos 4UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_VLAN_PRIORITY_Msk 0x70UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_RESERVED_7_Pos 7UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_RESERVED_7_Msk 0x80UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_VLAN_ENABLE_Pos 8UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_VLAN_ENABLE_Msk 0x100UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_INDEX_Pos 9UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_INDEX_Msk 0xE00UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_ETHERTYPE_ENABLE_Pos 12UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_ETHERTYPE_ENABLE_Msk 0x1000UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_COMPARE_A_Pos 13UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_COMPARE_A_Msk 0x3E000UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_COMPARE_A_ENABLE_Pos 18UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_COMPARE_A_ENABLE_Msk 0x40000UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_COMPARE_B_Pos 19UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_COMPARE_B_Msk 0xF80000UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_COMPARE_B_ENABLE_Pos 24UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_COMPARE_B_ENABLE_Msk 0x1000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_COMPARE_C_Pos 25UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_COMPARE_C_Msk 0x3E000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_COMPARE_C_ENABLE_Pos 30UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_COMPARE_C_ENABLE_Msk 0x40000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_RESERVED_31_Pos 31UL
#define ETH_SCREENING_TYPE_2_REGISTER_15_RESERVED_31_Msk 0x80000000UL
/* ETH.TX_SCHED_CTRL */
#define ETH_TX_SCHED_CTRL_TX_SCHED_Q0_Pos       0UL
#define ETH_TX_SCHED_CTRL_TX_SCHED_Q0_Msk       0x3UL
#define ETH_TX_SCHED_CTRL_TX_SCHED_Q1_Pos       2UL
#define ETH_TX_SCHED_CTRL_TX_SCHED_Q1_Msk       0xCUL
#define ETH_TX_SCHED_CTRL_TX_SCHED_Q2_Pos       4UL
#define ETH_TX_SCHED_CTRL_TX_SCHED_Q2_Msk       0x30UL
#define ETH_TX_SCHED_CTRL_TX_SCHED_Q3_Pos       6UL
#define ETH_TX_SCHED_CTRL_TX_SCHED_Q3_Msk       0xC0UL
#define ETH_TX_SCHED_CTRL_REMOVED_31_8_Pos      8UL
#define ETH_TX_SCHED_CTRL_REMOVED_31_8_Msk      0xFFFFFF00UL
/* ETH.BW_RATE_LIMIT_Q0TO3 */
#define ETH_BW_RATE_LIMIT_Q0TO3_DWRR_ETS_WEIGHT_Q0_Pos 0UL
#define ETH_BW_RATE_LIMIT_Q0TO3_DWRR_ETS_WEIGHT_Q0_Msk 0xFFUL
#define ETH_BW_RATE_LIMIT_Q0TO3_DWRR_ETS_WEIGHT_Q1_Pos 8UL
#define ETH_BW_RATE_LIMIT_Q0TO3_DWRR_ETS_WEIGHT_Q1_Msk 0xFF00UL
#define ETH_BW_RATE_LIMIT_Q0TO3_DWRR_ETS_WEIGHT_Q2_Pos 16UL
#define ETH_BW_RATE_LIMIT_Q0TO3_DWRR_ETS_WEIGHT_Q2_Msk 0xFF0000UL
#define ETH_BW_RATE_LIMIT_Q0TO3_DWRR_ETS_WEIGHT_Q3_Pos 24UL
#define ETH_BW_RATE_LIMIT_Q0TO3_DWRR_ETS_WEIGHT_Q3_Msk 0xFF000000UL
/* ETH.BW_RATE_LIMIT_Q4TO7 */
#define ETH_BW_RATE_LIMIT_Q4TO7_REMOVED_31_0_Pos 0UL
#define ETH_BW_RATE_LIMIT_Q4TO7_REMOVED_31_0_Msk 0xFFFFFFFFUL
/* ETH.BW_RATE_LIMIT_Q8TO11 */
#define ETH_BW_RATE_LIMIT_Q8TO11_REMOVED_31_0_Pos 0UL
#define ETH_BW_RATE_LIMIT_Q8TO11_REMOVED_31_0_Msk 0xFFFFFFFFUL
/* ETH.BW_RATE_LIMIT_Q12TO15 */
#define ETH_BW_RATE_LIMIT_Q12TO15_REMOVED_31_0_Pos 0UL
#define ETH_BW_RATE_LIMIT_Q12TO15_REMOVED_31_0_Msk 0xFFFFFFFFUL
/* ETH.TX_Q_SEG_ALLOC_Q0TO7 */
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_SEGMENT_ALLOC_Q0_Pos 0UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_SEGMENT_ALLOC_Q0_Msk 0x7UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_RESERVED_3_3_Pos 3UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_RESERVED_3_3_Msk 0x8UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_SEGMENT_ALLOC_Q1_Pos 4UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_SEGMENT_ALLOC_Q1_Msk 0x70UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_RESERVED_7_7_Pos 7UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_RESERVED_7_7_Msk 0x80UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_SEGMENT_ALLOC_Q2_Pos 8UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_SEGMENT_ALLOC_Q2_Msk 0x700UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_RESERVED_11_11_Pos 11UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_RESERVED_11_11_Msk 0x800UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_REMOVED_14_12_Pos 12UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_REMOVED_14_12_Msk 0x7000UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_RESERVED_15_15_Pos 15UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_RESERVED_15_15_Msk 0x8000UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_REMOVED_18_16_Pos 16UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_REMOVED_18_16_Msk 0x70000UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_RESERVED_19_19_Pos 19UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_RESERVED_19_19_Msk 0x80000UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_REMOVED_22_20_Pos 20UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_REMOVED_22_20_Msk 0x700000UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_RESERVED_23_Pos 23UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_RESERVED_23_Msk 0x800000UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_REMOVED_26_24_Pos 24UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_REMOVED_26_24_Msk 0x7000000UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_RESERVED_27_27_Pos 27UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_RESERVED_27_27_Msk 0x8000000UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_REMOVED_30_28_Pos 28UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_REMOVED_30_28_Msk 0x70000000UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_RESERVED_31_31_Pos 31UL
#define ETH_TX_Q_SEG_ALLOC_Q0TO7_RESERVED_31_31_Msk 0x80000000UL
/* ETH.TX_Q_SEG_ALLOC_Q8TO15 */
#define ETH_TX_Q_SEG_ALLOC_Q8TO15_REMOVED_31_0_Pos 0UL
#define ETH_TX_Q_SEG_ALLOC_Q8TO15_REMOVED_31_0_Msk 0xFFFFFFFFUL
/* ETH.RECEIVE_Q8_PTR */
#define ETH_RECEIVE_Q8_PTR_REMOVED_31_0_Pos     0UL
#define ETH_RECEIVE_Q8_PTR_REMOVED_31_0_Msk     0xFFFFFFFFUL
/* ETH.RECEIVE_Q15_PTR */
#define ETH_RECEIVE_Q15_PTR_REMOVED_31_0_Pos    0UL
#define ETH_RECEIVE_Q15_PTR_REMOVED_31_0_Msk    0xFFFFFFFFUL
/* ETH.DMA_RXBUF_SIZE_Q8 */
#define ETH_DMA_RXBUF_SIZE_Q8_REMOVED_31_0_Pos  0UL
#define ETH_DMA_RXBUF_SIZE_Q8_REMOVED_31_0_Msk  0xFFFFFFFFUL
/* ETH.DMA_RXBUF_SIZE_Q15 */
#define ETH_DMA_RXBUF_SIZE_Q15_REMOVED_31_0_Pos 0UL
#define ETH_DMA_RXBUF_SIZE_Q15_REMOVED_31_0_Msk 0xFFFFFFFFUL
/* ETH.INT_Q1_ENABLE */
#define ETH_INT_Q1_ENABLE_ENABLE_RECEIVE_COMPLETE_INTERRUPT_Pos 1UL
#define ETH_INT_Q1_ENABLE_ENABLE_RECEIVE_COMPLETE_INTERRUPT_Msk 0x2UL
#define ETH_INT_Q1_ENABLE_ENABLE_RX_USED_BIT_READ_INTERRUPT_Pos 2UL
#define ETH_INT_Q1_ENABLE_ENABLE_RX_USED_BIT_READ_INTERRUPT_Msk 0x4UL
#define ETH_INT_Q1_ENABLE_ENABLE_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT_Pos 5UL
#define ETH_INT_Q1_ENABLE_ENABLE_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT_Msk 0x20UL
#define ETH_INT_Q1_ENABLE_ENABLE_TRANSMIT_FRAME_CORRUPTION_DUE_TO_AMBA_ERROR_INTERRUPT_Pos 6UL
#define ETH_INT_Q1_ENABLE_ENABLE_TRANSMIT_FRAME_CORRUPTION_DUE_TO_AMBA_ERROR_INTERRUPT_Msk 0x40UL
#define ETH_INT_Q1_ENABLE_ENABLE_TRANSMIT_COMPLETE_INTERRUPT_Pos 7UL
#define ETH_INT_Q1_ENABLE_ENABLE_TRANSMIT_COMPLETE_INTERRUPT_Msk 0x80UL
#define ETH_INT_Q1_ENABLE_ENABLE_RESP_NOT_OK_INTERRUPT_Pos 11UL
#define ETH_INT_Q1_ENABLE_ENABLE_RESP_NOT_OK_INTERRUPT_Msk 0x800UL
/* ETH.INT_Q2_ENABLE */
#define ETH_INT_Q2_ENABLE_ENABLE_RECEIVE_COMPLETE_INTERRUPT_Pos 1UL
#define ETH_INT_Q2_ENABLE_ENABLE_RECEIVE_COMPLETE_INTERRUPT_Msk 0x2UL
#define ETH_INT_Q2_ENABLE_ENABLE_RX_USED_BIT_READ_INTERRUPT_Pos 2UL
#define ETH_INT_Q2_ENABLE_ENABLE_RX_USED_BIT_READ_INTERRUPT_Msk 0x4UL
#define ETH_INT_Q2_ENABLE_ENABLE_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT_Pos 5UL
#define ETH_INT_Q2_ENABLE_ENABLE_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT_Msk 0x20UL
#define ETH_INT_Q2_ENABLE_ENABLE_TRANSMIT_FRAME_CORRUPTION_DUE_TO_AMBA_ERROR_INTERRUPT_Pos 6UL
#define ETH_INT_Q2_ENABLE_ENABLE_TRANSMIT_FRAME_CORRUPTION_DUE_TO_AMBA_ERROR_INTERRUPT_Msk 0x40UL
#define ETH_INT_Q2_ENABLE_ENABLE_TRANSMIT_COMPLETE_INTERRUPT_Pos 7UL
#define ETH_INT_Q2_ENABLE_ENABLE_TRANSMIT_COMPLETE_INTERRUPT_Msk 0x80UL
#define ETH_INT_Q2_ENABLE_ENABLE_RESP_NOT_OK_INTERRUPT_Pos 11UL
#define ETH_INT_Q2_ENABLE_ENABLE_RESP_NOT_OK_INTERRUPT_Msk 0x800UL
/* ETH.INT_Q3_ENABLE */
#define ETH_INT_Q3_ENABLE_REMOVED_31_0_Pos      0UL
#define ETH_INT_Q3_ENABLE_REMOVED_31_0_Msk      0xFFFFFFFFUL
/* ETH.INT_Q7_ENABLE */
#define ETH_INT_Q7_ENABLE_REMOVED_31_0_Pos      0UL
#define ETH_INT_Q7_ENABLE_REMOVED_31_0_Msk      0xFFFFFFFFUL
/* ETH.INT_Q1_DISABLE */
#define ETH_INT_Q1_DISABLE_DISABLE_RECEIVE_COMPLETE_INTERRUPT_Pos 1UL
#define ETH_INT_Q1_DISABLE_DISABLE_RECEIVE_COMPLETE_INTERRUPT_Msk 0x2UL
#define ETH_INT_Q1_DISABLE_DISABLE_RX_USED_BIT_READ_INTERRUPT_Pos 2UL
#define ETH_INT_Q1_DISABLE_DISABLE_RX_USED_BIT_READ_INTERRUPT_Msk 0x4UL
#define ETH_INT_Q1_DISABLE_DISABLE_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT_Pos 5UL
#define ETH_INT_Q1_DISABLE_DISABLE_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT_Msk 0x20UL
#define ETH_INT_Q1_DISABLE_DISABLE_TRANSMIT_FRAME_CORRUPTION_DUE_TO_AMBA_ERROR_INTERRUPT_Pos 6UL
#define ETH_INT_Q1_DISABLE_DISABLE_TRANSMIT_FRAME_CORRUPTION_DUE_TO_AMBA_ERROR_INTERRUPT_Msk 0x40UL
#define ETH_INT_Q1_DISABLE_DISABLE_TRANSMIT_COMPLETE_INTERRUPT_Pos 7UL
#define ETH_INT_Q1_DISABLE_DISABLE_TRANSMIT_COMPLETE_INTERRUPT_Msk 0x80UL
#define ETH_INT_Q1_DISABLE_DISABLE_RESP_NOT_OK_INTERRUPT_Pos 11UL
#define ETH_INT_Q1_DISABLE_DISABLE_RESP_NOT_OK_INTERRUPT_Msk 0x800UL
/* ETH.INT_Q2_DISABLE */
#define ETH_INT_Q2_DISABLE_DISABLE_RECEIVE_COMPLETE_INTERRUPT_Pos 1UL
#define ETH_INT_Q2_DISABLE_DISABLE_RECEIVE_COMPLETE_INTERRUPT_Msk 0x2UL
#define ETH_INT_Q2_DISABLE_DISABLE_RX_USED_BIT_READ_INTERRUPT_Pos 2UL
#define ETH_INT_Q2_DISABLE_DISABLE_RX_USED_BIT_READ_INTERRUPT_Msk 0x4UL
#define ETH_INT_Q2_DISABLE_DISABLE_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT_Pos 5UL
#define ETH_INT_Q2_DISABLE_DISABLE_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT_Msk 0x20UL
#define ETH_INT_Q2_DISABLE_DISABLE_TRANSMIT_FRAME_CORRUPTION_DUE_TO_AMBA_ERROR_INTERRUPT_Pos 6UL
#define ETH_INT_Q2_DISABLE_DISABLE_TRANSMIT_FRAME_CORRUPTION_DUE_TO_AMBA_ERROR_INTERRUPT_Msk 0x40UL
#define ETH_INT_Q2_DISABLE_DISABLE_TRANSMIT_COMPLETE_INTERRUPT_Pos 7UL
#define ETH_INT_Q2_DISABLE_DISABLE_TRANSMIT_COMPLETE_INTERRUPT_Msk 0x80UL
#define ETH_INT_Q2_DISABLE_DISABLE_RESP_NOT_OK_INTERRUPT_Pos 11UL
#define ETH_INT_Q2_DISABLE_DISABLE_RESP_NOT_OK_INTERRUPT_Msk 0x800UL
/* ETH.INT_Q3_DISABLE */
#define ETH_INT_Q3_DISABLE_REMOVED_31_0_Pos     0UL
#define ETH_INT_Q3_DISABLE_REMOVED_31_0_Msk     0xFFFFFFFFUL
/* ETH.INT_Q7_DISABLE */
#define ETH_INT_Q7_DISABLE_REMOVED_31_0_Pos     0UL
#define ETH_INT_Q7_DISABLE_REMOVED_31_0_Msk     0xFFFFFFFFUL
/* ETH.INT_Q1_MASK */
#define ETH_INT_Q1_MASK_RECEIVE_COMPLETE_INTERRUPT_MASK_Pos 1UL
#define ETH_INT_Q1_MASK_RECEIVE_COMPLETE_INTERRUPT_MASK_Msk 0x2UL
#define ETH_INT_Q1_MASK_RX_USED_INTERRUPT_MASK_Pos 2UL
#define ETH_INT_Q1_MASK_RX_USED_INTERRUPT_MASK_Msk 0x4UL
#define ETH_INT_Q1_MASK_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT_MASK_Pos 5UL
#define ETH_INT_Q1_MASK_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT_MASK_Msk 0x20UL
#define ETH_INT_Q1_MASK_AMBA_ERROR_INTERRUPT_MASK_Pos 6UL
#define ETH_INT_Q1_MASK_AMBA_ERROR_INTERRUPT_MASK_Msk 0x40UL
#define ETH_INT_Q1_MASK_TRANSMIT_COMPLETE_INTERRUPT_MASK_Pos 7UL
#define ETH_INT_Q1_MASK_TRANSMIT_COMPLETE_INTERRUPT_MASK_Msk 0x80UL
#define ETH_INT_Q1_MASK_RESP_NOT_OK_INTERRUPT_MASK_Pos 11UL
#define ETH_INT_Q1_MASK_RESP_NOT_OK_INTERRUPT_MASK_Msk 0x800UL
/* ETH.INT_Q2_MASK */
#define ETH_INT_Q2_MASK_RECEIVE_COMPLETE_INTERRUPT_MASK_Pos 1UL
#define ETH_INT_Q2_MASK_RECEIVE_COMPLETE_INTERRUPT_MASK_Msk 0x2UL
#define ETH_INT_Q2_MASK_RX_USED_INTERRUPT_MASK_Pos 2UL
#define ETH_INT_Q2_MASK_RX_USED_INTERRUPT_MASK_Msk 0x4UL
#define ETH_INT_Q2_MASK_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT_MASK_Pos 5UL
#define ETH_INT_Q2_MASK_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT_MASK_Msk 0x20UL
#define ETH_INT_Q2_MASK_AMBA_ERROR_INTERRUPT_MASK_Pos 6UL
#define ETH_INT_Q2_MASK_AMBA_ERROR_INTERRUPT_MASK_Msk 0x40UL
#define ETH_INT_Q2_MASK_TRANSMIT_COMPLETE_INTERRUPT_MASK_Pos 7UL
#define ETH_INT_Q2_MASK_TRANSMIT_COMPLETE_INTERRUPT_MASK_Msk 0x80UL
#define ETH_INT_Q2_MASK_RESP_NOT_OK_INTERRUPT_MASK_Pos 11UL
#define ETH_INT_Q2_MASK_RESP_NOT_OK_INTERRUPT_MASK_Msk 0x800UL
/* ETH.INT_Q3_MASK */
#define ETH_INT_Q3_MASK_REMOVED_31_0_Pos        0UL
#define ETH_INT_Q3_MASK_REMOVED_31_0_Msk        0xFFFFFFFFUL
/* ETH.INT_Q7_MASK */
#define ETH_INT_Q7_MASK_REMOVED_31_0_Pos        0UL
#define ETH_INT_Q7_MASK_REMOVED_31_0_Msk        0xFFFFFFFFUL
/* ETH.INT_Q8_ENABLE */
#define ETH_INT_Q8_ENABLE_REMOVED_31_0_Pos      0UL
#define ETH_INT_Q8_ENABLE_REMOVED_31_0_Msk      0xFFFFFFFFUL
/* ETH.INT_Q15_ENABLE */
#define ETH_INT_Q15_ENABLE_REMOVED_31_0_Pos     0UL
#define ETH_INT_Q15_ENABLE_REMOVED_31_0_Msk     0xFFFFFFFFUL
/* ETH.INT_Q8_DISABLE */
#define ETH_INT_Q8_DISABLE_REMOVED_31_0_Pos     0UL
#define ETH_INT_Q8_DISABLE_REMOVED_31_0_Msk     0xFFFFFFFFUL
/* ETH.INT_Q15_DISABLE */
#define ETH_INT_Q15_DISABLE_REMOVED_31_0_Pos    0UL
#define ETH_INT_Q15_DISABLE_REMOVED_31_0_Msk    0xFFFFFFFFUL
/* ETH.INT_Q8_MASK */
#define ETH_INT_Q8_MASK_REMOVED_31_0_Pos        0UL
#define ETH_INT_Q8_MASK_REMOVED_31_0_Msk        0xFFFFFFFFUL
/* ETH.INT_Q15_MASK */
#define ETH_INT_Q15_MASK_REMOVED_31_0_Pos       0UL
#define ETH_INT_Q15_MASK_REMOVED_31_0_Msk       0xFFFFFFFFUL
/* ETH.SCREENING_TYPE_2_ETHERTYPE_REG_0 */
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_0_COMPARE_VALUE_Pos 0UL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_0_COMPARE_VALUE_Msk 0xFFFFUL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_0_RESERVED_31_16_Pos 16UL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_0_RESERVED_31_16_Msk 0xFFFF0000UL
/* ETH.SCREENING_TYPE_2_ETHERTYPE_REG_1 */
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_1_COMPARE_VALUE_Pos 0UL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_1_COMPARE_VALUE_Msk 0xFFFFUL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_1_RESERVED_31_16_Pos 16UL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_1_RESERVED_31_16_Msk 0xFFFF0000UL
/* ETH.SCREENING_TYPE_2_ETHERTYPE_REG_2 */
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_2_COMPARE_VALUE_Pos 0UL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_2_COMPARE_VALUE_Msk 0xFFFFUL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_2_RESERVED_31_16_Pos 16UL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_2_RESERVED_31_16_Msk 0xFFFF0000UL
/* ETH.SCREENING_TYPE_2_ETHERTYPE_REG_3 */
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_3_COMPARE_VALUE_Pos 0UL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_3_COMPARE_VALUE_Msk 0xFFFFUL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_3_RESERVED_31_16_Pos 16UL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_3_RESERVED_31_16_Msk 0xFFFF0000UL
/* ETH.SCREENING_TYPE_2_ETHERTYPE_REG_4 */
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_4_COMPARE_VALUE_Pos 0UL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_4_COMPARE_VALUE_Msk 0xFFFFUL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_4_RESERVED_31_16_Pos 16UL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_4_RESERVED_31_16_Msk 0xFFFF0000UL
/* ETH.SCREENING_TYPE_2_ETHERTYPE_REG_5 */
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_5_COMPARE_VALUE_Pos 0UL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_5_COMPARE_VALUE_Msk 0xFFFFUL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_5_RESERVED_31_16_Pos 16UL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_5_RESERVED_31_16_Msk 0xFFFF0000UL
/* ETH.SCREENING_TYPE_2_ETHERTYPE_REG_6 */
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_6_COMPARE_VALUE_Pos 0UL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_6_COMPARE_VALUE_Msk 0xFFFFUL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_6_RESERVED_31_16_Pos 16UL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_6_RESERVED_31_16_Msk 0xFFFF0000UL
/* ETH.SCREENING_TYPE_2_ETHERTYPE_REG_7 */
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_7_COMPARE_VALUE_Pos 0UL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_7_COMPARE_VALUE_Msk 0xFFFFUL
