RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/include/ip/cyip_eth.h
#define ETH_TYPE2_COMPARE_29_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_29_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_29_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_30_WORD_0 */
#define ETH_TYPE2_COMPARE_30_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_30_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_30_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_30_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_30_WORD_1 */
#define ETH_TYPE2_COMPARE_30_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_30_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_30_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_30_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_30_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_30_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_30_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_30_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_31_WORD_0 */
#define ETH_TYPE2_COMPARE_31_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_31_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_31_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_31_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_31_WORD_1 */
#define ETH_TYPE2_COMPARE_31_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_31_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_31_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_31_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_31_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_31_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_31_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_31_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL


#endif /* _CYIP_ETH_H_ */


/* [] END OF FILE */
